matteogastaldello/msp432-endpoint/main.c
#include "simplelink.h"
#include "sl_common.h"

//LCD & Sensor drivers and libraries
#include "msp.h"
#include <ti/devices/msp432p4xx/inc/msp.h>
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include <ti/grlib/grlib.h>
#include "LcdDriver/Crystalfontz128x128_ST7735.h"
#include "LcdDriver/HAL_MSP_EXP432P401R_Crystalfontz128x128_ST7735.h"
#include "HAL/HAL_I2C.h"
#include "HAL/HAL_TMP006.h"
#include "HAL/HAL_OPT3001.h"
//code libraries
#include <stdio.h>
#include <net/bsd/netdb.h>
#include <net/bsd/netinet/in.h>
#include <stdlib.h>
#include <string.h>
#include <socket.h>
#include <sys/types.h>
#include <unistd.h> // read(), write(), close()
#include <driverlib.h>
//external libraries
#include "JSON/cJSON.h"

#define MAX 80
#define PORT 8080
#define SA struct sockaddr

/*
 * Values for below macros shall be modified per the access-point's (AP) properties
 * SimpleLink device will connect to following AP when the application is executed
 */
#define SSID_NAME       "MspNet"       /* Access point name to connect to. */
#define SEC_TYPE        SL_SEC_TYPE_WPA_WPA2     /* Security type of the Access piont */
#define PASSKEY         "mspmatteo"   /* Password in case of secure AP */
#define PASSKEY_LEN     pal_Strlen(PASSKEY)      /* Password length in case of secure AP */

#define APPLICATION_VERSION "1.0.0"
///http start
#define SL_STOP_TIMEOUT        0xFF
#define SMALL_BUF           32
#define MAX_SEND_BUF_SIZE   512
#define MAX_SEND_RCV_SIZE   1024
///http end

//CommProtocol
#define HANDSHAKE_ACK  "HANDSHAKE_ACK"

//LCD Definitions
#define MENU_SIZE 3
#define INTERFACES_DIM_MAX 5
#define DATA_BUFFER_DIM 5
//END LCD Definitions


typedef struct
{
    int currentPos;
    float bufferData[DATA_BUFFER_DIM];
} Data_t;

Data_t tempData;
Data_t luxData;

//global variables for the control of the FSM
int countSampling = 0;
int ADC14_isOff = 0;
int back = 0;
int dataPos = 0; // ca be shared because at each sampling cycle both temp and lux add a data to their respective buffer, so they'll fill in parallel
int pressed = 0;
int currentState = 3;   // seta at 3 to make the FSM start in menu state
int selectedElement = 0;
int samplingStop;
int rerender;
bool isConfigurationMode = false;

//tcp var
int sockfd, connfd, len;
struct sockaddr_in servaddr, cli;
int firstStart;
bool isPaired;


/* Application specific status/error codes */
typedef enum
{
    DEVICE_NOT_IN_STATION_MODE = -0x7D0, /* Choosing this number to avoid overlap with host-driver's error codes */
    STATUS_CODE_MAX = -0xBB8
} e_AppStatusCodes;
/*
 * GLOBAL VARIABLES -- Start
 */
_u32 g_Status = 0;

Graphics_Rectangle menuRectangles[MENU_SIZE]; //array of rectangles that contains a rectangle for each state the machine can fall into.

/* Graphic library context */
Graphics_Context g_sContext;

/* Variable for storing temperature value returned from TMP006 */
float temp;

/* ADC results buffer */
static uint16_t resultsBuffer[2];

//definig a pointer to void function not receiving parameters as behaviour_t
typedef void (*behaviour_t)();



typedef struct
{
    // element selection
    int selectedElement;
    int (*selectionFunction)();

    // interfaces handling
    int interfacesDim;
    int selectedInterface;
    void (*interfaces[INTERFACES_DIM_MAX])();

    // behaviour
    behaviour_t behaviours[INTERFACES_DIM_MAX];

} State_t;

State_t states[4];  //the array of states the machine will move into


struct
{
    _u8 Recvbuff[MAX_SEND_RCV_SIZE];
    _u8 SendBuff[MAX_SEND_BUF_SIZE];

    _u8 HostName[SMALL_BUF];

    _u32 DestinationIP;
    _i16 SockID;
} g_AppData;

/*
 * Function that fills the states of the FSM each one with its own characterizing functions
 */
void menuRectanglesInit()
{

    int height = 30;
    int space = 10;
    int i = 0;

    int XMIN = 5;
    int XMAX = 128 - XMIN;
    int YMIN = 5;

    for (i; i < MENU_SIZE; i++)
    {
        menuRectangles[i].xMin = XMIN;
        menuRectangles[i].xMax = XMAX;
        menuRectangles[i].yMin = YMIN + i * space + i * height;
        menuRectangles[i].yMax = menuRectangles[i].yMin + height;
    }
}

/*
 * Function that stops ADC14
 */
void ADC14_Kill()
{
    ADC14_disableConversion();
    while (ADC14_isBusy())
        ;
    ADC14_disableModule();
    ADC14_isOff = 1;
}

/*
 * Function that restarts ADC14 --- can be used after a call to ADC14_Kill but not instead of ADC initialization
 */

void ADC14_Revive()
{
    ADC14_enableModule();
    ADC14_enableConversion();
    ADC14_toggleConversionTrigger();
    ADC14_isOff = 0;
}


//---------------------------MENU STATE---------------------------

/*
 * Function that renders the menu interface when FSM is in menu state (states[3])
 */
void menuInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    int i = 0;

    for (i; i < MENU_SIZE; i++)
    {
        Graphics_drawRectangle(&g_sContext, &menuRectangles[i]);
    }

    Graphics_fillRectangle(&g_sContext, &menuRectangles[selectedElement]);

    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "PAIRING MODE", 18, 64,
            (menuRectangles[0].yMax + menuRectangles[0].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "NORMAL MODE", 18, 64,
            (menuRectangles[1].yMax + menuRectangles[1].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "COMMUNICATION MODE", 18, 64,
            (menuRectangles[2].yMax + menuRectangles[2].yMin) / 2, OPAQUE_TEXT);

}

/*
 * Function that contains the behaviour of the FSM when in menu state (sates[3]) . It's empty because the behaviour of menu state is handled by adc14 when calls
 * selection function
 */
void menuStateBehaviour(){}


/*
 * Function that changes the selected rectangle inside menu when FSM is in menu state (state[3]).
 * I'ts fired by the ADC14 and if senses that the joystick on the boosterpack has been moved over a certain threshold it changes currentState variable
 * so at the next refresh another rectangle will be selected.
 * If it senses that the button under the joystick has been pressed then the currentState is selected and FSM's state is changed with the one selected
 */
int menuSelectionFunction()
{

    int intermediateValue;

    if (samplingStop == 0)
    {
        if (resultsBuffer[1] > 16330)    // joystick turned up
        {
            selectedElement--;
            samplingStop = 1;
            rerender = 1;

