matteogastaldello/msp432-endpoint/main.c
        }
        else if (resultsBuffer[1] < 50)    // joystick turned down
        {
            selectedElement++;
            samplingStop = 1;
            rerender = 1;

        }

        if (selectedElement < 0)    // this enables a circular menu selection
        {
            selectedElement = MENU_SIZE + selectedElement;
        }

        intermediateValue = selectedElement % MENU_SIZE;
        selectedElement = intermediateValue % MENU_SIZE;

        int i = 0;
        for (i; i < 300250; i++); // busy wait just to let some time pass before the new sample is taken

        if (!(P4IN & GPIO_PIN1) && pressed == 0)
        {
            pressed = 1;
            rerender = 1;

            int i = 0;
            for (i; i < 300250; i++); // busy wait just to let some time pass before the new sample is taken

            pressed = 0;

            ADC14_isOff = 1;
            currentState = selectedElement;

            //ADC14_Kill();

        }

    }

    samplingStop = 0;

    return 0;
}

//-------------------------------------NORMAL STATE----------------------------

/*
 * Function that when called renders the screen of normal mode (states[1])
 */
void normalModeRender()
{
    Graphics_clearDisplay(&g_sContext);
    //Graphics_drawRectangle(&g_sContext,&menuRectangles[0]);
    /* Display temperature */
    char tempString[30];
    char luxString[30];

    sprintf(tempString, "TEMP: %f", tempData.bufferData[tempData.currentPos]);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) tempString, 11, 55, 40,
    OPAQUE_TEXT);

    sprintf(luxString, "LUX: %f", luxData.bufferData[luxData.currentPos]);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) luxString, 11, 55, 60,
    OPAQUE_TEXT);

}

/*
 * Function that when called senses the environment through boosterpack sensors and stores the collected data inside data_t buffers
 */

void sensingMode(){
    float currentLuxData = OPT3001_getLux();
    luxData.bufferData[luxData.currentPos] = currentLuxData;
    int luxPartialPos = luxData.currentPos + 1;
    luxData.currentPos = luxPartialPos % DATA_BUFFER_DIM;

    /* Obtain temperature value from TMP006 */
    float tempIntermediate = TMP006_getTemp();

    tempIntermediate = tempIntermediate - 32;
    tempData.bufferData[tempData.currentPos] = tempIntermediate * 5 / 9;

    int tempPartialPos = tempData.currentPos + 1; //tempData.currentPos++;
    tempData.currentPos = tempPartialPos % DATA_BUFFER_DIM;
}

/*
 * Wrapper function that regulates the behaviour of FSM during normal state (states[1])
 */

void normalModeBehaviour()
{

    if(countSampling == 100000){
        sensingMode();
        rerender = 1;
        countSampling = 0;
    }
    countSampling++;


}

//-------------------------------------PAIRING STATE----------------------------

/*
 * Function that when called renders the screen of pairing mode (states[0])
 */
void pairingInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "Pairing", 7, 64, 30,
                                OPAQUE_TEXT);
    rerender = 0;
}

/*
 * Functions that  wrapps the behaviour of the FSM when in pairing state (states[0])
 */
void pairingBehaviour()
{

    communicationRoutine();

    if(!isPaired){
        communicationRoutine();
        isPaired = true;
    }
}


//-------------------------------------COMMUNICATION STATE----------------------------

/*
 * Function that when called renders the screen of communication mode (states[2])
 */
void communicationInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    char title[20];
    sprintf(title, "%s", "COLLECTED DATA");
    Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 14, 64, 5,
                                OPAQUE_TEXT);

    char dataString[10];
    int i = 0;

    for (i; i < DATA_BUFFER_DIM; i++)
    {

        sprintf(dataString, "%f", tempData.bufferData[i]);
        Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString, 10, 64,
                                    20 + i * 10, OPAQUE_TEXT);
    }

    rerender = 0;
}

/*
 * Function that when called shows data collected up to that moment from the temperature sensor present on the boosterpack
 */
void tempDataInterface()
{
    Graphics_clearDisplay(&g_sContext);

    char title[20];
    sprintf(title, "%s", "COLLECTED DATA-TEMP");
    Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 19, 64, 5,
                                OPAQUE_TEXT);

    char dataString[10];
    int i = 0;
    //char space[] = " ";

    for (i; i < DATA_BUFFER_DIM; i++)
    {

        sprintf(dataString, "%f", tempData.bufferData[i]);
        Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString, 10, 64,
                                    20 + i * 10, OPAQUE_TEXT);
    }

    rerender = 0;

}

/*
 * Function that when called shows data collected up to that moment from the light sensor present on the boosterpack
 */
void luxDataInterface()
{
    Graphics_clearDisplay(&g_sContext);

    char title[20];
    sprintf(title, "%s", "COLLECTED DATA-LUX");
    Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 18, 64, 5,
                                OPAQUE_TEXT);

    char dataString[10];
    int i = 0;

    for (i; i < DATA_BUFFER_DIM; i++)
    {

        sprintf(dataString, "%f", luxData.bufferData[i]);
        Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString, 10, 64,
                                    20 + i * 10, OPAQUE_TEXT);
    }

    rerender = 0;

}

/*
 * Placeholder function
 */
void noBehaviour(){}

/*
 *Function that when called sets currentState variable to 3 so the FSM state will be back to menu state as at starting time
 */
int backSelectionFunction()
{

    // CODICE
    rerender = 1;
    ADC14_Revive();
    currentState = 3;

