matteogastaldello/msp432-endpoint/main.c
    return 0;
}

void communicationBehaviour()
{
    if(countSampling == 100000){
        sensingMode();

        if(tempData.currentPos == DATA_BUFFER_DIM-1){
            //sensorsJSON();
            communicationMode();
        }
        countSampling = 0;
    }
    countSampling++;


}

int communicateSelectionFunction()
{
    //char string[30];

    //renderStop = 0;
    int intermediateValue;

    if (samplingStop == 0)
    {
        if (resultsBuffer[0] > 16330)    // joystick turned left
        {
            int intermediateInterface = states[currentState].selectedInterface
                    + 1;
            states[currentState].selectedInterface = intermediateInterface
                    % states[currentState].interfacesDim;

            samplingStop = 1;
            rerender = 1;

        }
        else if (resultsBuffer[0] < 50)    // joystick turned right
        {
            int intermediateInterface = states[currentState].selectedInterface
                    + 1;
            states[currentState].selectedInterface = intermediateInterface
                    % states[currentState].interfacesDim;

            samplingStop = 1;
            rerender = 1;
            //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,18,64,50,OPAQUE_TEXT);

        }

        //sprintf(string, "SElem : %d",selectedElement);
        //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,30,64,50,OPAQUE_TEXT);

        int i = 0;
        for (i; i < 300250; i++)
            ;
        samplingStop = 0;
        // busy wait per scandire il tempo di campionamento

        //Graphics_drawStringCentered(&g_sContext,(int8_t *) itoa(selectedElement,string) ,4,64,50,OPAQUE_TEXT);
        //       if (rerender==1)
        //       {
        //           menuInterfaceRender();
        //           rerender = 0;
        //       }

        if (!(P4IN & GPIO_PIN1))
        {
            // TEST CHECK
            //Graphics_clearDisplay(&g_sContext);
            //Graphics_drawStringCentered(&g_sContext, (int8_t*) "BACK FUNC", 9, 64,10, OPAQUE_TEXT);

            // CODICE
            rerender = 1;
            currentState = 3;

            //interfacePlaceholder(); //*(states[currentState].interfaces[states[currentState].selectedInterface])();
        }
    }
    return 0;
}

/*
 * Function that is called from the cycle that handles render of the screen in order to update the screen based upon the curerntState the FSM is in if
 * needed
 */
void render()
{
    if (rerender == 1)
    {
        (*states[currentState].interfaces[states[currentState].selectedInterface])();
        rerender = 0;
    }

}




void statesInitializer()
{
    // states are sorted thinking about the flow interactions should follow --- pairing, then collecting data, then communication to send it
    // menu is put at the last one and will be avoided scrolling using the joystick

    // states[0] initialization -- pairing state

    states[0].selectedElement = -1;
    states[0].selectionFunction = &backSelectionFunction;
    states[0].interfacesDim = 3; //pairing,paired,error
    states[0].selectedInterface = 0;
    states[0].interfaces[0] = &pairingInterfaceRender;           //ok
    states[0].behaviours[0] = &pairingBehaviour;

    // states[1] initialization -- normal state

    states[1].selectedElement = -1;
    states[1].selectionFunction = &backSelectionFunction;
    states[1].interfacesDim = 1;   // mostra i dati irt
    states[1].selectedInterface = 0;
    states[1].interfaces[0] = &normalModeRender;
    states[1].behaviours[0] = &normalModeBehaviour;

    // states[2] initialization -- communication state

    states[2].selectedElement = -1;
    states[2].selectionFunction = &backSelectionFunction;
    states[2].interfacesDim = 2; // sending, ok,error
    states[2].selectedInterface = 0;
    states[2].interfaces[0] = &tempDataInterface; //communicationInterfaceRender;            //ok
    states[2].interfaces[1] = &luxDataInterface;
    states[2].behaviours[0] = &communicationBehaviour;

    // states[3] initialization -- menu state

    states[3].selectedElement = 0;
    states[3].selectionFunction = &menuSelectionFunction;
    states[3].interfacesDim = 1; // 1 per ogni rettangolo selezionabile
    states[3].selectedInterface = 0;
    states[3].interfaces[0] = &menuInterfaceRender;         //ok
    states[3].behaviours[0] = &noBehaviour;
}

void _adcInit()
{
    /* Configures Pin 6.0 and 4.4 as ADC input */
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P6, GPIO_PIN0,
                                               GPIO_TERTIARY_MODULE_FUNCTION);
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN4,
                                               GPIO_TERTIARY_MODULE_FUNCTION);

    /* Initializing ADC (ADCOSC/64/8) */
    ADC14_enableModule();
    ADC14_initModule(ADC_CLOCKSOURCE_ADCOSC, ADC_PREDIVIDER_64, ADC_DIVIDER_8,
                     0);

    /* Configuring ADC Memory (ADC_MEM0 - ADC_MEM1 (A15, A9)  with repeat)
     * with internal 2.5v reference */
    ADC14_configureMultiSequenceMode(ADC_MEM0, ADC_MEM1, true);
    ADC14_configureConversionMemory(ADC_MEM0,
    ADC_VREFPOS_AVCC_VREFNEG_VSS,
                                    ADC_INPUT_A15, ADC_NONDIFFERENTIAL_INPUTS);

    ADC14_configureConversionMemory(ADC_MEM1,
    ADC_VREFPOS_AVCC_VREFNEG_VSS,
                                    ADC_INPUT_A9, ADC_NONDIFFERENTIAL_INPUTS);

    /* Enabling the interrupt when a conversion on channel 1 (end of sequence)
     *  is complete and enabling conversions */
    ADC14_enableInterrupt(ADC_INT1);

    /* Enabling Interrupts */
    Interrupt_enableInterrupt(INT_ADC14);
    Interrupt_enableMaster();

    /* Setting up the sample timer to automatically step through the sequence
     * convert.
     */
    ADC14_enableSampleTimer(ADC_AUTOMATIC_ITERATION);

    /* Triggering the start of the sample */
    ADC14_enableConversion();
    ADC14_toggleConversionTrigger();
}

