matteogastaldello/msp432-endpoint/main.c
void _graphicsInit()
{
    /* Initializes display */
    Crystalfontz128x128_Init();

    /* Set default screen orientation */
    Crystalfontz128x128_SetOrientation(LCD_ORIENTATION_UP);

    /* Initializes graphics context */
    Graphics_initContext(&g_sContext, &g_sCrystalfontz128x128,
                         &g_sCrystalfontz128x128_funcs);
    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);
    Graphics_clearDisplay(&g_sContext);

}

void _temperatureSensorInit()
{
    /* Temperature Sensor initialization */
    /* Initialize I2C communication */
    Init_I2C_GPIO();
    I2C_init();
    /* Initialize TMP006 temperature sensor */
    TMP006_init();
    __delay_cycles(100000);

}

void _hwInit()
{
    /* Halting WDT and disabling master interrupts */
    WDT_A_holdTimer();
    Interrupt_disableMaster();

    /* Set the core voltage level to VCORE1 */
    PCM_setCoreVoltageLevel(PCM_VCORE1);

    /* Set 2 flash wait states for Flash bank 0 and 1*/
    FlashCtl_setWaitState(FLASH_BANK0, 2);
    FlashCtl_setWaitState(FLASH_BANK1, 2);

    /* Initializes Clock System */
    CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_48);
    CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_HSMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_ACLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);

    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0);
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);

    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN1);
    Interrupt_enableInterrupt(INT_PORT1);

    Interrupt_setPriority(INT_PORT1, 0);
    Interrupt_setPriority(INT_ADC14, (uint8_t) 100);

    rerender = 1;

    _graphicsInit();
    _temperatureSensorInit();

    menuRectanglesInit();
    statesInitializer();

    _adcInit();
}

 /* grabbed and placed in resultsBuffer */
void ADC14_IRQHandler(void)
{
    uint64_t status;

    status = ADC14_getEnabledInterruptStatus();
    ADC14_clearInterruptFlag(status);

    /* ADC_MEM1 conversion completed */
    if (status & ADC_INT1)
    {

        /* Store ADC14 conversion results */
        resultsBuffer[0] = ADC14_getResult(ADC_MEM0);
        resultsBuffer[1] = ADC14_getResult(ADC_MEM1);

        render();

        if (currentState == 3)
            (*states[currentState].selectionFunction)();
        else if (currentState == 2){
            (*states[currentState].behaviours[0])();
        }

    }
}

void PORT1_IRQHandler()
{
    /* Check which pins generated the interrupts */
    uint_fast16_t status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P1);
    /* clear interrupt flag (to clear pending interrupt indicator */
    GPIO_clearInterruptFlag(GPIO_PORT_P1, status);
    /* check if we received P1.1 or P1.4 interrupt */
    if(status & GPIO_PIN1)
    {
        GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
        if(currentState == 0 || currentState == 1 || currentState == 2)
        {
            (*states[currentState].selectionFunction)();
        }
    }

}
/*
 * STATIC FUNCTION DEFINITIONS -- Start
 */
static _i32 establishConnectionWithAP();
static _i32 disconnectFromAP();
static _i32 configureSimpleLinkToDefaultState();
static _i32 initializeAppVariables();
static void displayBanner();
static _i32 getHostIP();
static _i32 createConnection();



void interruptSetup()
{
    //SETUP Button 1.1
    /* P1.1 as input for button */
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_registerInterrupt(GPIO_PORT_P1, PORT1_IRQHandler);
    /* Enable interrupts on Port 1 (to catch P1.1 and P1.4 interrupts) */
    Interrupt_enableInterrupt(INT_PORT1);

    /* Enabling MASTER interrupts */
    Interrupt_enableMaster();
}

// Function designed for chat between client and server.
void configurationMode()
{

    // Accept the data packet from client and verification
    connfd = SL_EAGAIN;
    while (connfd == SL_EAGAIN)
    {
        connfd = accept(sockfd, (SA*) &cli, &len);
    }

    if (connfd < 0)
    {
        CLI_Write("server accept failed...\n");
        exit(0);
    }
    else
        CLI_Write("server accept the client...\n");

    char buff[MAX];
    CLI_Write("Entering function...\n");
    uint32_t rcvd_bytes = 0;

    CLI_Write("Starting new read\n\r");
    int status = 0;
    bzero(buff, sizeof(buff));

    while (status != sizeof(buff))
    {
        do
        {
            status = sl_Recv(connfd, buff, sizeof(buff), 0);
        }
        while (status == SL_EAGAIN);
        char bf[100];
        sprintf(bf, "\nReceived packets (%d bytes) successfully\n\r", status);
        CLI_Write(bf);
        if (status < 0)
        {
            CLI_Write("TCP Error occured!\n");
            sl_Close(connfd);
            return (-1);
        }
        else if (status == sizeof(buff))
        {
            sl_Send(connfd, HANDSHAKE_ACK, sizeof(HANDSHAKE_ACK), 0);
        }
    }
    char tmp[100] = "";
    sprintf(tmp, "\nReceived %u packets (%u bytes) successfully\n\r",
            (status / 1), status);
    CLI_Write(tmp);
    sprintf(tmp, "\nMessage is: %s\n", buff);
    CLI_Write(tmp);
    status = 0;

    //sprintf(buff, "Closing Connection");
    // and send that buffer to client
    //sl_Send(connfd, buff, sizeof(buff), 0);
    // After chatting close the socket
    close(sockfd);

}

int communicationRoutine()
{
    int retVal;
    displayBanner();

    /*
     * Following function configures the device to default state by cleaning
     * the persistent settings stored in NVMEM (viz. connection profiles &
     * policies, power policy etc)
     *
     * Applications may choose to skip this step if the developer is sure
     * that the device is in its default state at start of application
     *
     * Note that all profiles and persistent settings that were done on the
     * device will be lost
     */

    if (firstStart)
    {
        retVal = configureSimpleLinkToDefaultState();
        if (retVal < 0)
        {
            if (DEVICE_NOT_IN_STATION_MODE == retVal)
                CLI_Write(
                        " Failed to configure the device in its default state \n\r");
            LOOP_FOREVER();
        }

        CLI_Write(" Device is configured in default state \n\r");

