matteogastaldello/msp432-endpoint/main.c
        /*
         * Assumption is that the device is configured in station mode already
         * and it is in its default state
         */
        retVal = sl_Start(0, 0, 0);
        if ((retVal < 0) || (ROLE_STA != retVal))
        {
            CLI_Write(" Failed to start the device \n\r");
            LOOP_FOREVER();
        }
        CLI_Write(" Device started as STATION \n\r");
        firstStart = false;
    }
    else
        close(sockfd);

    /* Connecting to WLAN AP */
    retVal = establishConnectionWithAP();
    if (retVal < 0)
    {
        CLI_Write(" Failed to establish connection w/ an AP \n\r");
        LOOP_FOREVER();
    }

    CLI_Write(" Connection established w/ AP and IP is acquired \n\r");

    //close socket if not first start
//            if (!firstStart)
//                close(sockfd);

    // socket create and verification
    sockfd = socket(AF_INET, SOCK_STREAM, 0);

    if (sockfd == -1)
    {
        CLI_Write("socket creation failed...\n");
        exit(0);
    }
    else
        CLI_Write("Socket successfully created..\n");

    SlSockNonblocking_t enableOption;
    enableOption.NonblockingEnabled = 1;
    sl_SetSockOpt(sockfd, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                  (_u8*) &enableOption, sizeof(enableOption)); // Enable/disable nonblocking mode

    bzero(&servaddr, sizeof(servaddr));

    // assign IP, PORT
    servaddr.sin_family = AF_INET;
    servaddr.sin_addr.s_addr = htonl(INADDR_ANY);
    servaddr.sin_port = htons(PORT);

    // Binding newly created socket to given IP and verification
    if ((bind(sockfd, (SA*) &servaddr, sizeof(servaddr))) != 0)
    {
        CLI_Write("socket bind failed...\n");
        exit(0);
    }
    else
        CLI_Write("Socket successfully binded..\n");

    // Now server is ready to listen and verification
    if ((listen(sockfd, 5)) != 0)
    {
        CLI_Write("Listen failed...\n");
        exit(0);
    }
    else
        CLI_Write("Server listening..\n");
    len = sizeof(cli);
    configurationMode();

    //code end
    retVal = disconnectFromAP();
    if (retVal < 0)
    {
        CLI_Write(" Failed to disconnect from the AP \n\r");
        LOOP_FOREVER();
    }
}

// Function designed for chat between client and server.
void communicationMode()
{
    // Accept the data packet from client and verification
    connfd = SL_EAGAIN;
    while (connfd == SL_EAGAIN)
    {
        connfd = accept(sockfd, (SA*) &cli, &len);
    }

    if (connfd < 0)
    {
        CLI_Write("server accept failed...\n");
        exit(0);
    }
    else
        CLI_Write("server accept the client...\n");

    char buff[MAX];
    CLI_Write("Entering function...\n");
    uint32_t rcvd_bytes = 0;

    CLI_Write("Starting new read\n\r");
    int status = 0;
    bzero(buff, sizeof(buff));

    while (status != sizeof(buff))
    {
        do
        {
            status = sl_Recv(connfd, buff, sizeof(buff), 0);
        } while (status == SL_EAGAIN);
        char bf[100];
        sprintf(bf, "\nReceived packets (%d bytes) successfully\n\r", status);
        CLI_Write(bf);
        if (status < 0)
        {
            CLI_Write("TCP Error occured!\n");
            sl_Close(connfd);
            return (-1);
        }
        else if (status == sizeof(buff))
        {
            //CREATING JSON
            char *out;
            cJSON *root, *temperatures, *luxArray, *sensorsData;

            /* create root node and array */
            root = cJSON_CreateObject();
            sensorsData = cJSON_CreateObject();

            temperatures = cJSON_CreateFloatArray(tempData.bufferData, DATA_BUFFER_DIM);
            cJSON_AddItemToObject(sensorsData, "temperatures", temperatures);


            luxArray = cJSON_CreateFloatArray(luxData.bufferData, DATA_BUFFER_DIM);;
            cJSON_AddItemToObject(sensorsData, "lux", luxArray);

            /* add sensors array to sensors Object */
            cJSON_AddItemToObject(root, "sensors", sensorsData);

            /* print everything */
            out = cJSON_Print(root);
            sl_Send(connfd, out, sizeof(out), 0);

            CLI_Write(out);
            free(out);

            /* free all objects under root and root itself */
            cJSON_Delete(root);

        }
    }
    char tmp[100] = "";
    sprintf(tmp, "\nReceived %u packets (%u bytes) successfully\n\r",
            (status / 1), status);
    CLI_Write(tmp);
    sprintf(tmp, "\nMessage is: %s\n", buff);
    CLI_Write(tmp);
    status = 0;

    //sprintf(buff, "Closing Connection");
    // and send that buffer to client
    //sl_Send(connfd, buff, sizeof(buff), 0);
    // After chatting close the socket
    close(sockfd);

}

void sensorsJSON(){
    char *out;
    cJSON *root, *temperatures, *luxArray, *sensorsData;

    /* create root node and array */
    root = cJSON_CreateObject();
    sensorsData = cJSON_CreateObject();

    temperatures = cJSON_CreateFloatArray(tempData.bufferData, DATA_BUFFER_DIM);
    cJSON_AddItemToObject(sensorsData, "temperatures", temperatures);


    luxArray = cJSON_CreateFloatArray(luxData.bufferData, DATA_BUFFER_DIM);;
    cJSON_AddItemToObject(sensorsData, "lux", luxArray);

    /* add sensors array to sensors Object */
    cJSON_AddItemToObject(root, "sensors", sensorsData);

    /* print everything */
    out = cJSON_Print(root);
    CLI_Write(out);
    free(out);

    /* free all objects under root and root itself */
    cJSON_Delete(root);
}

/*
 * Application's entry point
 */
int main(int argc, char **argv){
    _i32 retVal = -1;
    firstStart = true;
    retVal = initializeAppVariables();
    ASSERT_ON_ERROR(retVal);
    /* Stop WDT and initialize the system-clock of the MCU */
    stopWDT();
    interruptSetup();
    initClk();
    /* Configure command line interface */
    CLI_Configure();

    //communicationRoutine();

    _hwInit();

    while (1)
    {
//        if (ADC14_isOff == 1)
//        {
            render();
            (*states[currentState].behaviours[0])();
//        }
    }

